Repository: alireza-fa/authentication_in_django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fa

source: English
fa: انگلیسی

source: Persian
fa: فارسی

source: Accounts Config
fa: تنظیمات حساب ها

source: username
fa: نام کاربری

source: password
fa: پسورد

source: username must less than 32 chars.
fa: نام کاربری باید کمتر از 32 کاراکتر باشد

source: not found any account with information
fa: هیچ حسابی با این مشخصات یافت نشد

source: this username already exist.
fa: این نام کاربری در حال حاضر وجود دارد

source: password must have more than or equal 8 chars.
fa: پسورد باید بزرگ تر و یا مساوی با 8 کارکتر باشد

source: Phone number
fa: شماره موبایل

source: This phone number does not exist.
fa: حسابی با این شماره موبایل وجود ندارد

source: This phone number already exist.
fa: حسابی با ایم شماره موبایل وجود دارد

source: email
fa: ایمیل

source: This email does not exist
fa: حسابی با این ایمیل وجود ندارد

source: This email already exist.
fa: حسابی با این ایمیل وجود دارد

source: code
fa: کد

source: invalid code.
fa: کد نامعتبر

source: Expiration time is over
fa: مدت زمان اعتبار به اتمام رسیده است

source: You have successfully logged in via your mobile number.
fa: شما با موفقیت از طریق بوزرنیم و پسورد ثبت نام کردید

source: You have successfully registered via your mobile number.
fa: شما با موفقیت از طریق بوزرنیم و پسورد ثبت نام کردید

source: You have successfully logged in via your email.
fa: شما با موفقیت از طریق ایمیل لاگین کردید

source: You have successfully registered via your email
fa: شما با موفقیت از طریق ایمیل ثبت نام کردید

source: Email or Phone number
fa: ایمیل یا شماره موبایل

source: phone number
fa: شماره موبایل

source: is admin
fa: ادمین است/نیست

source: is active
fa: فعال است/نیست

source: User
fa: کاربر

source: Users
fa: کاربران

source: user
fa: کاربر

source: count
fa: تعداد

source: lock time
fa: زمان قفل شده

source: Effort Authenticate
fa: تلاس اعتبار سنجی

source: Efforts authenticate
fa: تلاش های اعتبار سنجی

source: expire time
fa: زمان اعتبار

source: Otp code
fa: کد تایید اعتبار

source: Otp codes
fa: کد های تایید اعتبار

source: Login And Register With Github
fa: ورود و ثبت نام با گیت هاب

source: Login And Register With Google
fa: ورد و ثبت نام با گوگل

source: Login Combine
fa: ورود بصورت ترکیبی(ایمیل، شماره موبایل، گوگل و گیت هاب)

source: Login Email
fa: ورود با ایمیل

source: Login With Email
fa: ورود با ایمیل(ارسال کد یکبار مصرف)

source: Login
fa: ورود

source: Login Phone Number
fa: ثبت نام با استفاده از شماره موبایل(ارسال کد یکبار مصرف)

source: In this method, we authenticate users using a phone number.
fa: در این روش ما با گرفتن شماره موبایل عملیات اعتبار سنجی را انجام میدهیم

source: Note: This method is recommended.
fa: این روش پیشنهادی من هستش.

source: me in this project use kave negar(is iranian service)
fa: در این پروژه من وب سرویس اس ام اس کاوه نگار استفاده کرده ام.

source: technologies:
fa: تکنولوژی ها

source: sms web service, rabbitmq, celery, session
fa: وب سرویس اس ام اس، ربیت ام کیو، سلری و سشن

source: Login Username
fa: ورود با استفاده از یوزرنیم

source: In this method, we authenticate users using a username and password.
fa: در این روش ما با گرفتن نام کاربری و پسورد عملیات اعتبار سنجی را انجام میدهیم

source: Note: This method is not recommended.
fa: تذکر: این روش پیشنهاد نمیشود

source: Register Combine
fa: ثبت نام به صورت ترکیبی(ایمیل، شماره موبایل، گوگل و گیت هاب)

source: Register Email
fa: ثبت نام با ایمیل

source: Register With Email
fa: ثبت نام با استفاده از ایمیل(ارسال کد یکبار مصرف)

source: Register
fa: ثبت نام

source: Register Phone Number
fa: ثبت نام با استفاده از شماره موبایل(ارسال کد یکبار مصرف)

source: Register Username
fa: ثبت نام با استفاده از یوزرنیم

source: In this method, we register users using a username and password.
fa: در این روش ما با گرفتن نام کاربری و پسورد عملیات ثبت نام را انجام میدهیم

source: Note: This method is not recommended
fa: تذکر: این روش پیشنهاد نمیشود. زیرا در این روش از ثبت نام تنها چیزی که از کاربر میگیریم نام کاربری است. همانطور که میدانید هر کاربر یک مشتری به حساب می آید و اگر ما بخوایم محصول جدیدی را به مشتری های خودمان معرفی کنیم نام کاربری به چه درد ما میخورد ؟

source: Verify Otp Code
fa: تایید کردن کد اعتبار

source: Otp Code
fa: کد اعتبارسنجی

source: This number is not a valid phone number.
fa: شماره موبایل وارد شده معتبر نمیباشد

source: you are logged in with username and password successfully.
fa: شما با موفقیت از طریق بوزرنیم و پسورد لاگین شدید

source: You have successfully registered with your username and password.
fa: شما با موفقیت از طریق بوزرنیم و پسورد ثبت نام کردید

source: We have sent a code to your phone number.
fa: ما یک کد به شماره موبایل شما ارسال کردیم

source: We have sent a code to your email.
fa: ما یک کد به ایمیل شما ارسال کردیم

source: Core Config
fa: تنظیمات هسته

source: Home
fa: خانه

source: Choose one of the authentication ways below:
fa: نحوه اعتبار سنجی را از روش های زیر انتخاب کنید

source: Authentication with Username
fa: اعتبار سنجی با استفاده از یوزرنیم و پسورد(ساده ترین روش)

source: Authentication with Phone number
fa: اعتبار سنجی با استفاده از شماره موبایل(ارسال کد یکبار مصرف)

source: Authentication with Email
fa: اعتبار سنجی با استفاده از ایمیل(ارسال کد یکبار مصرف)

source: Authentication with Google
fa: اعتبار سنجی از طریق حساب گوگل

source: Authentication with GitHub
fa: اعتبار سنجی با استفاده از گیت هاب

source: Authentication with Phone number or Email + Google + Github
fa: اعتبار سنجی ترکیبی(شماره موبایل یا ایمیل یا گوگل و یا گیت هاب)

source: API
fa: ای پی آی

source: Authentication with api Token
fa: اعتبار سنجی با استفاده از توکن(api)

source: Choose one of the registration ways below:
fa: نحوه ثبت نام را از روش های زیر انتخاب کنید.

source: registration with Username
fa: ثبت نام با استفاده از یوزرنیم(ساده ترین روش)

source: registration with Phone number
fa: ثبت نام با استفاده از شماره موبایل(ارسال کد یکبار مصرف)

source: registration with Email
fa: ثبت نام با استفاده از ایمیل(ارسال کد یکبار مصرف)

source: registration with Google
fa: ثبت نام از طریق حساب گوگل

source: registration with GitHub
fa: ثبت نام با گیت هاب

source: registration with Phone number or Email + Google + Github
fa: ثبت نام ترکیبی(شماره موبایل یا ایمیل یا گوگل و یا گیت هاب)

source: About this project:
fa: درباره پروژه

source: In this project, I try to use many methods for authentication and registration. I hope this project is useful for you.
fa: در این پروژه، روش های مختلفی برای اعتبار سنجی و ثبت نام استفاده کرده ام. مدل یوزر رو کاستومایز کردم، همچنین برای اینکه بتونم از متد اعتبارسنحی برای ایمیل و یوزرنیم و شماره موبایل استفاده کنم، آث بک اند های خودم رو اضافه کردم. توضیحات بیشتر در صفحات هر کدام از روش های اعتبار سنجی و ثبت نام داده شده است. همچنین یک مدل برای شمارش دفعات پشت سر هم ورود ناموفق یک حساب کاربری نوشتم که این را به ساده ترین شکل ممکن نوشتم فقط برای این منظور تا به شما یاد‌آوری کنم در پروژه های واقعی به این موضوع توجه کنید. امیدوارم این پروژه برای شما دوستان عزیز مفید باشه.

source: In this project have two language(english and persian).
fa: این پروژه به دوزبان فارسی و انگلیسی نوشته شده است اما در زبان فارسی توضیحات کامل تری داده ام

source: Please look at the source code for a better understanding.
fa: لطفا برای اینکه درک بهتری داشته باشید به سورس کد پروژه با دقت نگاه کنید.

source: Logout
fa: خروج
